[{"language": "en", "domain": "a", "url": "https://www.huffpost.com/entry/trump-cnn-town-hall-democrats_n_645c4655e4b09eef83045482", "text": "Senior Reporter, HuffPost Democrats and media watchers blasted CNN Wednesday night over the network’s combative, lie-filled town hall with former President Donald Trump. Moderator Kaitlan Collins attempted to rein in Trump as he stood by his denial of the results from the 2020 presidential election, rejected the lawsuit that found him liable for sexual abuse and defamation against the writer E. Jean Carroll, and defended his decision to take classified documents to Florida after his presidency. But Collins struggled to fact-check the former president in real-time, and many sharply criticized CNN for putting Trump on-air at all. At one point, Trump called Collins a “nasty person” as she tried to get an answer to a question. the CNN town hall audience laughs as Trump smears E Jean Carroll pic.twitter.com/HIokiAqIom Put almost none of it on Collins. Nobody could manage a serial liar sexual predator authoritarian with an audience hand-picked to cheer on his most insane and offensive comments. That was a decision her bosses made. https://t.co/rNdLetk4Fm “Tonight’s disaster must be a lesson that every other news organization on earth must learn: DO NOT NORMALIZE DONALD TRUMP,” the Lincoln Project, a Republican group opposing Trump, said in a statement. “CNN gave Trump 90 minutes of uninterrupted air time to rewrite history and reset his own narrative.” New York Rep. Alexandria Ocasio-Cortez (D) said the decision to platform Trump was “shameful” after his appearance, saying his comments Wednesday reflected the difficulty people have coming forward with allegations of sexual assault. Trump mocked Carroll as a “whack job” Wednesday as a friendly audience laughed and applauded him. “I think it was a profoundly irresponsible decision,” Ocasio-Cortez said on MSNBC. “What we saw tonight was a series of extremely irresponsible decisions that put a sexual abuse victim at risk...in front of a national audience, and I could not have disagreed with it more.” Rep. Alexandria Ocasio-Cortez on CNN town hall with former President Trump: What we saw tonight was a series of extremely irresponsible decisions that put a sexual abuse victim at risk...in front of a national audience, and I could not have disagreed with it more. It was shameful pic.twitter.com/DOrMkBIEzq Michael Fanone, the former Washington, D.C., police officer who was assaulted on Jan. 6, 2021, told HuffPost he was aghast after the town hall. “It’s worse than I could have ever imagined. It’s an absolute disaster,” Fanone said. “There’s no way to fact-check this guy in real time. He’s a volcano of bullshit.” New York Times reporter Jonathan Swan reported Wednesday night Trump’s advisers were “thrilled” with his appearance at the town hall. “They can’t believe he is getting an hour on CNN with an audience that cheers his every line and laughs at his every joke,” he said. I can’t believe this is being allowed on @cnn. This is promulgating the cult leadership of Trump — and people are laughing at sexual assault. God save us. And now trump says it’s because women LET YOU grab ‘em by the pussy. #TrumpTownHall This is CNN's lowest moment as an organization.(And I remember the glory days of their \"balanced\" panels back in 2015-2016.) What is the journalistic justification for this town hall, @CNN, and how can just justify doing this without having your moderator fact-checking the constant stream of lies you knew were coming? Senior Reporter, HuffPost Do you have information you want to share with HuffPost? \r\n    Here’s how. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy."}, {"language": "en", "domain": "a", "url": "https://www.ynetnews.com/article/hkqnwf00mn", "text": "The Jewish community in the U.S. has long faced antisemitism on college campuses, but in recent years the plague of Jew hatred is trending younger and younger. Ynetnews spoke with American Jewish students and parents from across the United States and found that antisemitism in high school and even elementary school is on the rise, partly due to a left-wing agenda that portrays Jews as a part of the “privileged” in America, rather than a historically persecuted minority group. << Follow Ynetnews on Facebook and Twitter >> More stories:  DeSantis: 'What's right with the Middle East is Israel' Major increase in antisemitic attacks - Haredi Jews are primary targets | Special report BDS targets South African students for student charity American Jews are now at a crossroads as far-right antisemitism is also on the rise from white supremacist groups in the United States. The result isn’t only affecting students on college campuses, but also students in high school and elementary school. The rise in antisemitism is having a direct impact on the next generation of American Jews from childhood onward. While campus activism focuses mostly on anti-Israel activity that often crosses into antisemitism, high school antisemitism, according to the numerous parents who spoke to Ynetnews, is closer to cut-and-dried antisemitism. In February, Henry Bens, a teacher at Mt. Eden High School in Hayward, California, made headlines when news surfaced that he assigned students to read and annotate material containing blatantly antisemitic conspiracy theories in the module teaching about the Holocaust. The teacher had also on numerous occasions performed a “Heil Hitler” salute in class, according to his 10th-grade students. After much criticism, the high school ultimately placed Bens on leave – but the antisemitism from teachers and administrators like Bens appears to be running rampant in America. A culture of bullying One parent from Northern California, who asked not to be identified for fear of retaliation by the school against her children, who are ages 11 and 14, explains that it is known that antisemitic bullying is occurring at her child’s high school. She says that her 14-year-old son, who attends a local public school, was attacked multiple times once his peers discovered he was Jewish. Two students on separate occasions approached her son and said “Heil Hitler” with the accompanying salute, but when she reported the incidents to the school officials claimed nothing could be done because it took place outside of school hours and off campus. \"The school said that because it was outside of campus and school hours, the only thing they could do were restorative circles, or for the racist students to write something about the Holocaust ... but severe measures could not be taken,\" she explains. \"So now my son has no real incentive to denounce antisemitic incidents because he can see that the school ‘cares less’ what happens to Jews.\" This mother, who also serves on the parent's committee of the school, says that while the schools have been aggressively pushing DEI (diversity, equity and inclusion) curriculum and holding educational sessions for the students about every other minority group, she was repeatedly told over the last two years that the school didn’t have time for an educational session on the Holocaust. This is despite the fact that when her son’s class read a book about the Holocaust it was used by the teacher to exclusively discuss anti-Black racism, not antisemitism. Of the antisemitic incidents her son experienced, she adds: \"The other kids heard both times what was said and did nothing because kids are taught in the school to be horrified mainly when something is said against Blacks, but not against Jews.\" Co-opting the Holocaust Across the country in Brooklyn, another mother, Aliza, says the same thing is taking place at her child’s public elementary school. The state of New York requires that schools provide diversity training and, in many cases, the recommended curriculum incorporates Black Lives Matter and other social justice movement ideologies. While her child has not experienced antisemitism directly within the school, the administration and the parent's committee on which she serves have repeatedly promoted antisemitic content. In one instance, the President’s Council of parents and school administrators in the district held a session on the current curriculum which featured a Nazi swastika to educate about anti-Black racism, without even mentioning the Holocaust. The school also failed, for multiple years, to bring a speaker to educate about antisemitism. “An email, which I was a recipient of, was sent out by our CEC (Community Education Council) to all the middle and elementary schools in the district, with a recommended curriculum that explicitly supported the BDS movement, and encouraged teachers across New York to incorporate this in their lessons, an act which is technically against the law as BDS is illegal in New York,\" Aliza told Ynetnews. Roy Harel, who is now a university student, also told Ynetnews he faced antisemitic bullying in high school in New York in 2015 that made him struggle with his Jewish and Israeli identity. I was very much ashamed of being Israeli and being Jewish and it took me until sophomore year of college to get out of that and for my identity to become something I can be proud of At Walt Whitman High School in Huntington, New York, Harel was harassed by his peers for being Jewish, including comments such as “Hi kike' on a regular basis, and swastikas drawn by fellow students on the board of his 10th grade Spanish class for weeks, while the teacher did nothing to stop them. “I was really proud of my Jewish and Israeli origins and I made it known and, as a result, many students basically used that as a green light to draw swastikas and the teacher pretty much ignored it,” he said. In another instance, Harel was running for student government when the opposing candidates ran a campaign platform against him that said “Don’t vote for the Jew.” The school claimed that it was taking the issue seriously but never reported what disciplinary action, if any, was taken. Harel says that while the school did eventually take disciplinary action against the teacher, the administration never answered whether or not students who were engaged in antisemitic bullying were reprimanded due to “privacy concerns.” “All of these experiences profoundly shaped me for a very long time. I was very much ashamed of being Israeli and being Jewish and it took me until sophomore year of college to get out of that and for my identity to become something I can be proud of,\" according to Harel. Although Harel overcame the antisemitism he experienced in high school, it did have a profound impact on him. One can only guess how many Jewish students in America choose to stay silent in university and after as a result of the indoctrination that occurs in American public schools. The Battle for Campus Harel reports that as an activist for Israel on college campus he has continued to face antisemitism, although much more of it has been related to modern antisemitism focused on Israel from the far left, as opposed to Hitler references and more classic antisemitic attacks. Ron Belman, a senior at the University of California, Berkeley and a fellow at the Committee for Accuracy in Middle East Reporting (CAMERA), tells Ynetnews that he agrees with this assessment. \"In terms of where the antisemitism is growing, it is from left-wing spaces and groups. This comes in the form of anti-Zionism through either lies or inaccuracies of what goes on in Israel,\" Belman says. \"I’ve seen this in places like the student senate, when hundreds of students showed up to protest passing the IHRA definition (of antisemitism) and turned the meeting into an Israel-bashing session rather than what it really was, which is about protecting Jewish students,\" he adds. StopAntisemitism, a watchdog organization, reported in late 2022 that a shocking 55% of students surveyed reported being the victim of antisemitism on a US college campus, and 72% reported that university administrations fail to take antisemitism and personal safety seriously. This is particularly dangerous at times of conflict in Israel when Jews around the world are targeted. However, StopAntisemitism also reported that 55% of students said they need to hide their support for Israel, whereas 73% said they feel they need to hide their Jewish identity on campus regardless of affiliation with Israel. The results of the survey show very clearly that the issue of anti-Israel activity on US campuses is almost always a modern manifestation of antisemitism rather than a legitimate discussion on the issue or policies of the Jewish state. Experts like Aviva Rosenschein, the director of community engagement for CAMERA's Israel office, argue that instead of the problem being dealt with on campus it's intensifying even at administrative levels. \"Antisemitism veiled as 'criticism of Israel' or 'anti-Zionism' is nothing new. What is new is that academics and university administrators refuse to recognize that campus groups like Students for Justice in Palestine and Jewish Voice for Peace openly target Jews and Jewish institutions on campus, and lionize terror groups that murder Jews,\" she says. Fighting Back The parents who spoke to Ynet all report similar trends, and they all have a common, growing concern over the way antisemitism is portrayed by teachers and administrators as somehow less important than other forms of bigotry – largely as a result of intentionally biased and, in some cases antisemitic, social justice-oriented curriculum. “We have really reached a crisis point in U.S. schools when it comes to dealing with Jew hatred. Administrators and teachers don’t take the issue seriously enough and subscribe to movements that intentionally exclude Jews from conversations on civil rights,” says Brooke Goldstein, executive director of the Lawfare Project and founder of the End Jew Hatred movement. “Jewish youth are being raised to be ashamed of who they are instead of empowered,\" she says. \"The only solution to this onslaught of attacks on Jews is to demand accountability at all levels – from the US Department of Education to individual teachers, while also working at the grassroots level to educate Jewish youth about how to fight Jew hatred whenever and wherever they face it.”"}, {"language": "en", "domain": "a", "url": "https://www.refinery29.com/en-us/2023/05/11382578/quiet-luxury-fashion-trend-succession-tiktok", "text": "For the past two years, fashion was concerned with the ultra flashy styles of the Y2K era. The maximalist styling, sky-high shoes, and micro-mini hemlines that synonymous with the early 2000s had reappeared to take over the 2020s zeitgeist. Now, however,  it’s hard to find that kind of gratuitous glitz, as runway collections have focused on perfecting wearable styles and today’s It girls are forgoing gaudiness. Meanwhile, on TikTok, fashion fans are deeply invested in “quiet luxury,” trading Y2K-inspired trends for minimalist styles and muted color palettes, and becoming a phenomenon in the process. Thanks to the latter, the search term “quiet luxury” has surpassed 35 billion views on TikTok, with its twin concept “stealth wealth” growing to over 600 million views. Inspired by shows like HBO’s Succession and celebrities like Kendall Jenner and Sofia Richie, creators are diving deep into the idea that not looking wealthy is the richest thing you can do, providing everything from “old money” outfit inspiration and tutorials on how to look “expensive” to explainers on why the 1% dresses this way. Quiet luxury is nothing new. Tech billionaires like Bill Gates and Mark Zuckerberg have worn three-figure t-shirts to work for decades, while brands like Bottega Veneta have chosen to forgo logos, making craftsmanship the reasoning for the $6,000 price tag on their bags. But recently, a chain of pop culture phenomena have unleashed the internet’s fascination with the art of looking wealthy, but stealthily. When HBO’s Succession, a show about an American media empire helmed by the Roy family, premiered its final season on March 26, the characters’ clothing became as talked about as the plot. Earlier this year, Gwyneth Platrow’s courtroom outfits, including minimalist and neutral-toned pieces from brands like The Row and Proenza Schouler, kept social media engaged for the course of her ski accident trial. Then, when Coachella Festival opened its doors for the first weekend in mid-April, Kendall Jenner — known for years to have attended the festival in jeweled clothing and overly accessorized outfits — surprised fans by wearing a basic black tank top and matching pants. Most recently, the internet put the spotlight on Sofia Richie’s wedding  in France, which featured custom Chanel pieces and a slew of quiet luxury outfits. One TikTok creator noted the aesthetic made Richie look like a “rich wife.” Meanwhile, runway trends have become increasingly demure, minimal, preppy, and, well, basic. Take, for example, the craze over Bottega Veneta and Prada’s white tank tops for fall 2022, with the former opening its show with a simple white top and blue jeans (made out of leather). Or the denim maxi skirt comeback that’s become fashion’s trendiest style for 2023. At the fall 2023 shows earlier this year, capsule wardrobes were the biggest trend. So much so that fashion critic Cathy Horyn wrote, “I think I'll vomit if I hear the word ‘wardrobe’ one more time,” in one of her reviews. Yet none of those examples come cheap. And there lies the contradiction of quiet luxury: spending a lot, looking like less. So, why is TikTok obsessed with dressing like ladies who lunch? Laura Beltrán Rubio, founder of the fashion history platform, Culturas de Moda, says that in its own way quiet luxury may represent a rebellion for Gen Z: “Fashion has been very loud and logo-heavy over the past few years, so I’m inclined to think that they may see it as a counter proposition to all tha.” But, for Jonathan Square, assistant professor at Parsons School of Design, the issue lies in the overnight pendulum swing and rapid prioritization of quiet luxury over maximalist styles, which often include aesthetics rooted in Black communities. “There would be no absolutely nothing wrong with minimalism, but I think it becomes problematic when you attach superiority,” says Square. “Now, people say outright that they’re going for an ‘old money’ aesthetic, which is clearly classist.” At the root of it all is a desire to assimilate — or, even escape. Growing up in a colony like Puerto Rico, I know a thing or two about being indoctrinated into acting, dressing, and aspiring to be like your colonizer — or the ruling class. From a young age, I saw local magazines preaching that the elegant and classic styles worn by socialites and royalty like Jackie Kennedy, Queen Letizia of Spain, and Kate Middleton, and which San Juan-based socialites followed to a tee, were superior to the trends that emerged on the streets of Puerto Rico. If a girl wanted respectability, and most of all, access to opportunities and spaces she wasn't supposed to have, wearing popular fashion trends, like baggy jeans, colorful tube tops, and hoop earrings, was not the way to go. The key was to look like you were born into so much wealth that you had no reason to show it off — only bask in it. I navigated that kind of code-switching from the time I was in middle school. When I moved to San Juan, where wealthier communities lived, I shed layers of rural styles and absorbed the Eurocentric looks celebrated there. “There is a racist undertone in this because it goes against the native cultural expressions of other communities, who are not the white elite,” says Beltrán. Spaces where the white elite are the norm were the starting point for Succession costume designer Michelle Matland, who recalls physically spending time in places where the upper class mingles to get a sense of what they wear and how they behave. “In early stages, a lot of time was spent researching, not just in magazines and online, but physically visiting restaurants, corporate offices and the like,” Matland tells Refinery29. “We spent months finding out who these people are so that we can be as authentic and real as possible and tell the story we were trying to tell.” Over the past three seasons, Matland’s work has made people deeply curious about clothes that might look basic but that have a hefty price tag which tells a different story. “The idea was if you have real money, you don’t show it off,” she says. “These people have mega money and it’s expensive and it’s tasteful but it’s not labeled or showy.” This concept came to a head in the show’s Season 4 premiere, in which Cousin Greg’s date brings a large tote bag to a family function. Tom Wambsgams, who married into the Roy family himself, mocks the bag as “ludicrously capacious.” He continues: \"What’s even in there, huh? Flat shoes for the subway? Her lunch pail? I mean, Greg, it’s monstrous. It’s gargantuan. You could take it camping. You could slide it across the floor after a bank job.\" It’s a hilarious take on the oversized tote bag as the official handbag of the working class — or, rather, the bag of the classes who need to work. Matland admits her team spent months deciding on the right handbag to show in this scene, choosing a Burberry Large London Tote Bag — retailing for over $2,000 — that features the house’s iconic print. “We decided the handbag should be as traditionally outrageous as it could possibly be without being unrealistic or distracting from the story,” Matland says. But more than the size, it was about the bag’s print. The choice made Greg’s date an outsider. Historically, logos, flashiness, and vibrant clothing has often been dismissed by rich and white groups, according to Square. “There’s long roots to this bias that people are tapping into when they use words like ‘understated’ or ‘pared down,’” he says. “It’s aesthetic whiteness.” And recently, Square points out that the fashion world has been shedding its streetwear layers, which were highly popular in the late 2010s, resurfacing styles and aesthetics that represent a pendulum swing. “It just seems like people are sort of retreating back to things that have been historically associated with wealthy white people,” he says. With young women on TikTok promoting the idea that a monochrome outfit makes one look like a “rich wife,” it’s clear that quiet luxury is about a lot more than just clothes. Amid an impending recession and cost of living crisis, there’s a clear desire from quiet luxury promoters to escape this reality by using the trend as yet another aspirational costume. But, in the process, both the industry and fashion fans are furthering a centuries-long assimilation that’s always shed cultural richness from BIPOC communities. And that speaks volumes."}, {"language": "en", "domain": "a", "url": "https://www.calciomercato.com/news/napoli-scouting-in-oriente-un-grande-colpo-a-zero-e-l-annuncio-d-68533", "text": "ERROR: Must enable cookies to access site"}, {"language": "en", "domain": "a", "url": "https://mashable.com/article/muppets-mayhem-review", "text": "The Muppets Mayhem begins with a rather brilliant idea: Center a comedy series on the chaotic but charismatic band Dr. Teeth and the Electric Mayhem. Since debuting on the pilot of The Muppet Show in 1975, this madcap musical act has delivered wackiness and bliss while appearing alongside a dazzling slew of stars. Their new Disney+ show is at its best when it leans into these sweet spots, playing toe-tapping songs and lining up cameos that range from surprising to deranged. However, where The Muppets Mayhem fumbles is in its dogged interest in the human hangers-on of this epic band. Essentially, when the spotlight shifts from the Mayhem to humans, things get meh. For decades, the Electric Mayhem has been touring the U.S. nonstop, making famous friends and fields of fans along the way. However, they've yet to record an album. Leave it to an ambitious record exec (Lilly Singh) to change that. To save a company on its last legs, Nora must get the band to deliver the album they took an advance on ages before. However, troubles pop up at every turn (well, in every episode), and she's always ill-prepared. Despite the record industry being her vocation, Nora knows virtually nothing about this band that's so seminal that they're beloved by music legends like Tommy Lee, Lil Nas X, \"Weird Al\" Yankovic, and Paula Abdul. While the band battles past demons, reveals touching origin stories, and grapples with their creative insecurities, The Muppets Mayhem binds its A-plot to a boring businesswoman who exists chiefly to nag and manipulate to get her way. Yes, yes, Nora will learn life lessons along the way, much as you'd expect from a Disney property. But why did the writers pick \"selfish suit\" as the archetype to center the show around? It's as inexplicable as when The Smurfs movie(opens in a new tab) was pegged to a make-up executive. Adult audiences aren't tuning in for the human actors paired with the nostalgia-tweaking critters they love, and kids won't care about the stakes of a record company going belly-up or the tedious love triangle between Nora, Mayhem fanboy Moog (Tahj Mowry), and tedious biz bro JJ (Anders Holm). The Muppets Mayhem also works in themes about sisterhood by wedging in Nora's TikTok-obsessed influencer sibling Hannah (Saara Chaudry). How else would they work in Animal doing TikTok dances? (Yes, the arc about the band falling hard for social media is forced and terrible!) Creators Adam F. Goldberg, Bill Barretta, and Jeff Yorkes punish Muppets fans by making us endure the insipid Nora storylines, but their writers' room has done a remarkable job of recapturing the magic of Muppet Show banter and the gleeful capriciousness of the band. Cold opens boast quick and silly setups and punchlines that spark chuckles, which ring out over the rocking theme song. The comedy of this crew is enthrallingly silly. For instance, when the band is challenged to write a new song, they get stuck, writing a string of beginnings, middles, and ends, and the rule of threes means each of these is increasingly silly, poking fun at the music industry with a gentle foam finger. (All the same, you might be singing their clumsy choruses to yourself because they are catchy.) Over 10 episodes, The Muppets Mayhem has space to relish in each of the bandmates. Mumbling Lips (Peter Linz) has two running gags: being indecipherable in his speech and the most well-connected Muppet in Hollywood. He's often entering a scene with a big celeb on his arm, and there's a contagious joy in watching these stars genuinely giddy to be working alongside Muppets. (Who could blame them?) Spaced-out Zoot (Dave Goelz) has terrible recall from too many years — uh — tripping on the road. His confusion over the concept of a documentary about the band (a groan-inducing promotion for Disney+'s Beatles doc) leads to actors popping by to audition in costumes that are a cross between funny and frightening. Elsewhere, Animal bops about with bunnies and drums, playing the eternal kid brother to the band. Meanwhile, Janice's hippie-dippy philosophies lead to a gentle mockery of the self-help industry and the blurry line between wellness centers and cults. Unquestionably, bassist Floyd Pepper (Matt Vogel) has always been the hottest member of the Electric Mayhem. I won't be addressing questions. This is fact. Here, the minds behind the Muppets smartly tap into the Pedro Pascal effect, though sadly not by casting the actor in a cameo (just imagine!). Instead, they tap into Pedro's Protective Daddy energy in The Mandalorian and The Last of Us by creating an origin story for Animal that makes Floyd into a crushable father figure. But that's not all. An episode unfurling the origins of the group's iconic van, Dr. Teeth's name, and how he and Floyd started the band proves to be an emotional lynchpin in the series. Flashbacks give compelling complexity to these long-goofy musicians. The episode plays into themes of parents at war with their art-aspiring kids, bringing the Muppet bounce to a serious topic; the results are familiar but reassuring and fun. Dr. Teeth also gets a fiery old flame, some psychological analysis, and the chance to explain how he's not really the frontman, despite the band's original name. And this is where The Muppets Mayhem is at its best. While these characters might have been created for musical bits and pithy punchlines, this series shows there is more to them. And it's a thrill to watch them play together, even when they play rough. In their van, there's always cheerful chatter, dumb jokes, and good vibes. It's a pleasure just to get to hang out with the Mayhem. This show could have just leaned into the chaos of this motley crew as a series of sketches, surreal and sweet. It's such a bummer when the show leaves them to return to Nora's tiresome Sad Girl Tour. Muppet productions can work when centered on a human, as The Muppet Christmas Carol proved with a deeply committed Scrooge in Michael Caine. However, this only works when the human meets the level of energy or intensity of the colorful kooks around them. (See also Tim Curry as Long John Silver in Muppet Treasure Island or Charles Grodin as the lusty cat burglar in The Great Muppet Caper). Here, the humans aren't legendary baddies; they're just flustered millennials. Moreover, Singh and company aren't giving theatrical, weird Muppet movie performances but are putting on woefully sanitized, broad 'n' bouncy Disney Channel acts. (Please remember Grodin went so far as to insist he and Miss Piggy had a torrid affair.(opens in a new tab)) Even with the bland human hangers-on, The Muppets Mayhem is a rollicking delight. I binged a bunch of episodes in one sitting and repeatedly paused because I was cackling too hard to hear what the band had to say next. So, I unreservedly recommend Muppets fans young and old to jump on board this bombastic bus and rock along with the Electric Mayhem...Just keep the remote handy to scroll through the human drudgery. And if the show gets a second season, here's hoping it embraces the Mayhem and kicks their too-human entourage to the curb. The Muppets Mayhem streams exclusively on Disney+(opens in a new tab) May 10. More in\nDisney+, Streaming Kristy Puchko is the Film Editor at Mashable. Based in New York City, she's an established film critic and entertainment reporter, who has traveled the world on assignment, covered a variety of film festivals, co-hosted movie-focused podcasts, interviewed a wide array of performers and filmmakers, and had her work published on RogerEbert.com, Vanity Fair, and The Guardian. A member of the Critics Choice Association and GALECA as well as a Top Critic on Rotten Tomatoes, Kristy's primary focus is movies. However, she's also been known to gush over television, podcasts, and board games. You can follow her on Twitter. (opens in a new tab)"}, {"language": "en", "domain": "a", "url": "https://www.cnbctv18.com/news/income-tax-department-holds-raid-at-mankind-pharma-office-16627601.htm", "text": "The income tax department conducts raid at the Mankind Pharma office. CNBC-TV18 has reached out to the company and is awaiting a reply. The company's shares fell as much as 6 percent, which comes days after the condom maker listed on exchanges with sharp gains.The shares of Mankind Pharma ended 32.4 percent higher at Rs 1,430 apiece on listing day. It made a stellar debut on the stock exchanges NSE and BSE, listing at Rs 1,300 apiece against the issue price of Rs 1,026-1,080 per share — a 20.4 percent premium to the issue price.The pharmaceutical and consumer health company's over Rs 4,300 crore initial public offering  opened for subscription on April 25 and concluded on April 27.The initial public offer got subscribed 15.32 times on the last day of the offer. The category for Qualified Institutional Buyers  got subscribed 49.16 times, the Retail Individual Investors  portion received 0.92 times subscription and non-institutional investors 3.8 times.Out of the 77 anchor investors, 44 are domestic mutual fund houses that have participated in the anchor round via different schemes. Notable domestic fund houses that have taken part include HDFC Mutual Fund, SBI Mutual Fund, and ICICI Pru MF, among others.More details are awaited on the Income Tax department raid held at the Mankind Pharma office."}, {"language": "en", "domain": "a", "url": "https://shadowandact.com/the-bachelorette-charity-lawson-stuns-in-the-key-art-for-her-upcoming-season-exclusive", "text": "ERROR: Must enable cookies to access site"}, {"language": "en", "domain": "a", "url": "https://www.koreaherald.com/view.php?ud=20230511000640", "text": "COVID-19 will no longer be classified at the highest degree of emergency in South Korea from June, three years and four months after its designation as such. President Yoon Suk Yeol convened a meeting of Cabinet members in charge of the COVID-19 response on Thursday and announced the country would be exiting the state of national emergency. “Today the government COVID-19 response headquarters decided to downgrade COVID-19’s status as an emergency. It is a delight that South Koreans will be able to get back to normal life,” he said. Saluting health care workers, Yoon said, \"To get to this day our health care workers have been on the front lines of the pandemic, working under immense pressure. You have shown incredible dedication. On behalf of the South Korean people, I thank you.\" He also thanked scientists for their work in developing vaccines and treatments and the people for complying with COVID-19 rules. The president added that the government will not stop preparing for a possible next pandemic, cooperating more closely with other countries and investing in domestic vaccine development capabilities. Speaking at a briefing held the same day, the Korea Disease Control and Prevention Agency chief Jee Young-mee said that although COVID-19 “isn’t over,” the forthcoming changes will mark “the beginning of treating it like other respiratory diseases.” “COVID-19 is still a pandemic. The difference now is that we are managing it on an everyday response basis,” she said. For many South Koreans who are already living near-normal lives, the emergency ending will not mean drastic changes. Not all rules are going away, and policy efforts of reduced intensity will be maintained. Masking will continue to be required at all hospitals with beds. For at-risk groups, testing and treatment costs will remain covered. Still some key changes include PCR testing not being recommended any more to people traveling to South Korea. Isolation for patients from the day of diagnosis will be recommended and not mandated, and the period cut to five days from the current seven. Thursday’s announcement follows the World Health Organization declaring an end to COVID-19 as a public health emergency over the previous weekend. The Ministry of Health and Welfare said that the WHO declaration, although an important consideration, was only one of many factors that were examined in shifting the country’s response. The decision to lift the emergency status was reached by consensus of government health officials and a committee of outside experts, the ministry explained. South Korea’s decision to end emergency status, as with the WHO’s, is “reasonable” but future risks still lurk, according to Dr. Jerome Kim, director general of the International Vaccine Institute based in Seoul. “Given the status of vaccination, boosting and hybrid immunity -- meaning vaccination plus infection -- in Korea, unless a radically different variant appears, the country is now in a position where the virus will infect but not cause disproportionate harm to the Korean people,” he told The Korea Herald. The IVI chief added that although the country may be ready to transition out of emergency status now, progress could be threatened by a new, potentially disruptive variant. “Will there be shifts in the severity and transmissibility in SARS-CoV-2? Possibly. Are we ready? No.” He said that over the course of the pandemic, much of the world “moved on earlier than it was medically safe.” “From an attitude perspective the world wants to move on. From a public health perspective, it hasn’t internalized the lessons and prepared for the future.” He said that the country’s response as the emergency status expires should continue to stress testing and isolation for people working around those especially at risk of bad outcomes. Infectious disease expert Dr. Kim Woo-joo of Korea University Medical Center warned the policy move comes at a time when the country is entering what may be the next large wave of cases. “Since the beginning of the spring semester, we are seeing precursors of a possible eighth wave,” he told The Korea Herald. According to Our World in Data, South Korea had the greatest caseload per million people, despite testing not being conducted as routinely. The R value, which measures how many secondary infections are generated per case on average, has been calculated at above 1 since the last week of March. An R value of 1 or higher means the spread is growing. The last large wave of COVID-19 in the country was last summer, when omicron’s BA.5 subvariant was dominant, with the daily case count peaking at 151,708 on Aug. 10, 2022. The dominant variant here currently is XBB, which is deemed to be about 20 percent more transmissible than its omicron predecessor. Kim, who heads the Korean Vaccine Society, said the government was “failing to do what is necessary to protect the medically vulnerable.” Two-thirds of people in their 60s and older here have not yet been vaccinated with a vaccine updated to respond to two omicron subvariants. More than 30 percent of newly diagnosed patients were 60 and older, with the latest seven-day average death count pushed to two digits. Nearly half of intensive care beds were filled. “The government ended the bivalent vaccine program early April. Additional booster shots are offered to people 65 and older, when the mark should be 60,” he said. “More than 40 million doses of vaccines are lying around, not getting to people’s arms.” Since identifying its first case on Jan. 20, 2020, South Korea has counted a total of 31,351,686 cases as of Thursday. Officially, COVID-19 has claimed 34,583 lives of people here to date. Out of the eligible population aged 5 and up, 86 percent are fully vaccinated with a primary series. Among adults aged 18 and up, the full vaccination rate stands at 96 percent. "}]